# frozen_string_literal: true

tap "homebrew/cask"
tap "buo/cask-upgrade"
brew "mas"

brew 'ruby-build'
brew 'node'
brew 'rbenv'
brew 'nodenv'
brew 'awscli'
brew 'tree'
brew 'openssl'
brew 'docker'
brew 'libpq'
brew 'libffi' 
brew 'protobuf'
brew 'shared-mime-info'
brew 'curl'
brew 'wget'
brew 'tig'
brew 'tmux'
brew 'fzf'
brew 'ag'

cask '1password'
cask '1password-cli'
cask 'visual-studio-code'
cask 'iterm2'
cask 'notion'
